#lang racket
(provide series.html)
(require SMathML)
(define $sum (Mo "&sum;"))
(define (&sum x_n)
  (: $sum x_n))
(define series.html
  (TnTmPrelude
   #:title "无穷级数的理论和应用"
   #:css "styles.css"
   (H1 "无穷级数的理论和应用")
   (H2 "第1章 实数理论的原理")
   (H2 "第2章 实数序列")
   ((definition #:n "24")
    (Ol (Li "序列" (@ $x_n) "被称为有界的, 如果存在常数" $K "满足不等式"
            (MB (&<= (&abs $x_n) $K))
            "对于每个" $n "均成立.")
        (Li "序列" (@ $x_n) "被称为单调递增的, 如果" (&<= $x_n (_ $x (&+ $n $1)))
            "对于每个" $n "均成立; 单调递减的, 如果" (&>= $x_n (_ $x (&+ $n $1)))
            "对于每个" $n "均成立.")))
   ((definition #:n "25")
    "序列" (@ $x_n) "被称为趋零序列 (null sequence), 如果对于任意正数" $epsilon
    "的选择, 总能找到" (&= $n_0 (app $n_0 $epsilon)) ", 满足不等式"
    (MB (&< (&abs $x_n) $epsilon))
    "对于每个" (&> $n $n_0) "成立.")
   ((theorem #:n "26")
    "如果" (@ $x_n) "是一个趋零序列, 并且另一个序列" (@ (_^ $x $n $prime))
    "的项, 对于大于特定的" $m "的每个" $n "满足条件"
    (&<= (&abs (_^ $x $n $prime)) (&abs $x_n)) ", 或者更一般的条件"
    (MB (&<= (&abs (_^ $x $n $prime)) (&d* $K (&abs $x_n))) ",")
    "其中" $K "是一个任意(但固定)的正数, 那么" (@ (_^ $x $n $prime))
    "也是一个趋零序列. (比较测试.)")
   ((theorem)
    "如果" (@ $x_n) "是一个趋零序列, 而" (@ $a_n) "是任意的有界序列, 那么由"
    (MB (&= (_^ $x $n $prime) (&i* $a_n $x_n)))
    "定义的序列是趋零的.")
   ((theorem #:n "27")
    "如果" (@ $x_n) "是一个趋零序列, 那么" (@ $x_n) "的任意子序列"
    (@ (_^ $x $n $prime)) "也是趋零序列.")
   
   (H2 "第3章 正项级数")
   (P "本章我们关心正项级数, 或者至少是非负项级数. 这里两者都被称为正项级数, "
      "也就是说正被理解为非严格的正. 对于这样一个级数" (&sum $a_n)
      "而言, 既然" (&>= $a_n $0) ", 那么我们有"
      (MB (&>= (&= $s_n (&+ (_ $s (&- $n $1)) $a_n)) (_ $s (&- $n $1))) ",")
      "于是部分和序列" (@ $s_n) "是一个单调递增序列, 其行为是特别简单的.")
   (P "第一个主要的判别法. 正项级数要么收敛要么发散至"
      (&+ $inf) ", 并且其收敛当且仅当部分和有界.")
   ((theorem)
    "如果" $p "是正整数, 那么两个级数"
    (MB (sum (&= $n $0) $inf $a_n) "和"
        (sum (&= $n $p) $inf $a_n))
    "同时收敛或发散, 并且在收敛的情况下,"
    (MB (&= (sum (&= $n $0) $inf $a_n)
            (&+ $a_0 $a_1 $..c (_ $a (&- $p $1))
                (sum (&= $n $p) $inf $a_n))) "."))
   ((theorem)
    "如果" (&sum $c_n) "是收敛的正项级数, 那么" (&sum (&i* $gamma_n $c_n))
    "亦收敛, 如果因子" $gamma_n "是(非严格)正但有界的数字.")
   
   (H2 "第4章 任意项级数")
   (H2 "第5章 幂级数")
   (H2 "第6章 所谓初等函数的展开")
   (H2 "第7章 无穷积")
   (H2 "第8章 ")
   ))